# Проект "Веб-приложение о рыбной ловле"

## Описание:
Проект представляет собой веб-приложение, разработанное с использованием Ruby on Rails, которое позволяет пользователям отслеживать свои рыболовные достижения. Программа охватывает ключевые аспекты разработки на Ruby on Rails, включая создание моделей, представлений и контроллеров (MVC), обеспечение безопасности приложения, работу с базами данных, использование RESTful маршрутизации и реализацию тестов для проверки функциональности.

## Особенности:
- **Аутентификация и авторизация:** Пользователи могут регистрироваться и входить в свои учетные записи. Для безопасности доступа к данным реализован механизм аутентификации и авторизации.
- **Журнал рыбалки:** Пользователи могут делать записи о своих рыболовных походах, указывая количество пойманной рыбы и добавляя комментарии к каждому дню.
- **Анализ данных:** Пользователи могут анализировать свои рыболовные результаты с помощью графиков, отображающих зависимость веса пойманной рыбы от дня.
- **Социальное взаимодействие:** Пользователи могут взаимодействовать с другими участниками веб-сайта, просматривая список лучших рыболовов и их рыболовных достижений.

## Технологии:
- Ruby on Rails
- HTML, CSS, JavaScript
- База данных

## Структура проекта:
- **Модели, контроллеры, представления (MVC):** Реализация основной функциональности приложения, включая работу с данными и взаимодействие с пользователем.
- **Аутентификация и авторизация:** Обеспечение безопасности приложения с помощью механизмов аутентификации и авторизации.
- **База данных и ORM:** Работа с базой данных, включая миграции и оптимизацию запросов.
- **Тестирование:** Реализация тестов для проверки функциональности и безошибочной работы приложения.

## Скриншоты приложения:

### Авторизация

![Скриншот 1](vxod.png)

### Главная страница

![Скриншот 2](main.png)

### Добавление записи

![Скриншот 3](add.png)

### График зависимости пойманной рыбы от дня

![Скриншот 4](graptg.png)

### Топ - 10 рыболовов

![Скриншот 4](top.png)